{
  "letters": [
    {
      "name": "Dear Anti-Semites, and Racists",
      "author": "Giang Vu",
      "date": "17th November 2025",
      "letter": "In times of injustice, silence only strengthens the oppressor...",
      "image": "",
      "peek": ""
    },
    {
      "name": "Rewriting Our Future",
      "author": "Tu Ho",
      "date": "17th November 2025",
      "letter": "Dear Government Officials,\n\nCensorship is often portrayed as a tool to maintain the structure of a country, the image of that country and social stability. According to BBC Earth and Britannica, instead of acting as their citizens’ protection, it restricted people from certain rights. There is a deeper and more unsettling truth, which is that censorship acts as a picture frame that shapes humans in the way it wants. It determines who gets the right to mic up, who is silenced, whose pain attracts attention and who is ignored. Nowadays, even though the government claims to protect pure morality, these leaders' true intention is prioritising their authority. In this way, it not only suppresses freedom, but it is also the forbidden of the truth in a materialistic world, the interpretation of history, and the resolve in the loss of humanity, leading to a brutal fact that truth can be selective. When truth is selective, justice starts to fade. If the truth is hidden behind the backstage, then how can justice be performed universally\n\nCensorship allows prejudice and privilege to be practised. It isn’t simply the silence of words, but it is the silence of the truth, of a community. This issue is critical not only of the forbidden truth but also of the interpretation of history. Basically, when governments and institutions decide what information can be debated, they prioritise their authority while muting others. The act of suppressing speech doesn’t help a system to control intolerance; it creates both fear and rage. Censorship ensures that only “suitable” or acceptable voices are heard; the others that seem to challenge or question their status are denied. In most of the system, privilege acts like a gatekeeper that separates humanity from the truth. Those with more privilege can easily access “platforms”, influence humanity, or even participate in important discussions with protection. While those without that privilege are shut down and oppressed. This inequality is deeply rooted in every political system, where people are living in a materialistic world, where honour, status and profit are more valuable than human beings. The truth is, who truly benefits from this silence? We all know it serves only those who are in charge of this system. They avoid criticism, refuse to confront the corruption of this system model and continue to rule despite the hardships. Yet, if we begin to raise awareness, we should ask ourselves a question: Should the system ever be determined by the directors only, or is it a universal ethic in which it is considered by the whole world?\n\nThe silence of the oppression that censorship brought to us is debatable. The tragedy of the actor Yu Mengkong, whose death was covered by silence due to the government censorship. After his death, to avoid the news spreading to the public, the Chinese government deleted all reports and online discussion, leaving the ashes of information of his death in the dead-end alley.  Those governments kept citizens from learning the truth, censored all news, and, above all, stifled his life by silencing his voice and denying him the freedom to live. This not only denied Yu Mekong the justice that he was supposed to receive but also eliminated the community's right to seek for the truth. For individuals, censorship isolates them from free speech. For marginalised groups, it reinforces the belief that their lives matter less in society. When the truth is hidden, victims are also forgotten, and while the cycle of censorship continues, Yu Mengkong’s story does not end here; it is a fate that will be repeated for many others, only to be met with further government silence. It is a system that values image over lives, obedience over the truth, and authority over human beings. Yu Mengkong’s story isn’t simply about social distance, but it is an alarm that awakens humans from a system that abuses the actual meaning of power and authority and anonymity as a system for protecting citizens but instead controlling them like a puppet. \n\nCensorship benefits most of those who have the power to rule a society. By controlling public opinion, they ensure that their authority will remain undefeated and drive the society as they will, like how propaganda was created and used for war and stereotypes. Ultimately, most governments rely on silence to preserve their order, an order built on fear rather than genuine respect. In this environment, privilege seems to be dominant because it is protected from criticism. Those who are not directly placed in the situation enjoy the luxury of being obeyed, while those who are silenced carry an invisible weight of the truth. Therefore, censorship is more like a weapon that is used not only to create a barrier that hides the truth behind the system but also to maintain the dominance of the powerful.\n\nIn conclusion, it indirectly supports prejudice, protects privilege and prevents seekers from pursuing the truth. If a government’s purpose is to serve its citizens with fairness, it must encourage free speech and open debate even when such discussions may challenge or criticise those in power. Transparency and authenticity are not threats to stability; instead, they are the very forces that strengthen it. After all, censorship doesn’t create peace; it is tolerated in the society, and it merely forces individuals into silence and buries the truth, like a gun pointed at the people, like a ghost that wanders around and haunts the city, like a thick fog that blinds the public and suffocates any spark of honesty before it can be lit up. \n\nWith hope to enhance the community.\n\nTu Ho.",
      "image": "",
      "peek": ""
    },
    {
      "name": "To Netanyahu",
      "author": "Khoi Nguyen",
      "date": "18th November 2025",
      "letter": "Dear Benjamin Netanyahu,\n\nYou are an evil and masochistic person. The ceasefire deal has been signed, so it is time to stop the genocide in Palestine. Millions of innocent women and children are being torn apart by your commands, targeting hospitals and schools. It is time to stop. As the Prime Minister of the Jewish state of Israel, who gave you the right to kill innocent people en masse?\n\nSince the ceasefire deal, more than 100 Palestinians have died from military action by the Israeli military, mostly children, women, and elderly people. Despite the deal, your government has made no effort to enforce it and has broken the policy countless times; this isn’t just a war anymore, it is a genocide. Not to mention, most airstrike targets on your agenda are full of residential areas, schools, and hospitals—trust me, no military is crazy enough to station their troops there. If this isn’t racism, what is it?\n\nThis is truly terrible.\n\nSure, the Allies bombed German and Japanese residential areas all the time, but that was seven decades ago; things have changed. And do not try to legitimize your actions by comparing them to WWII; they carpet-bombed, while you target specific areas with precision technology. Families torn apart, lives ruined, opportunities taken away—it carries on even when ceasefire deals are signed. You are truly a terrible, racist, masochistic person. How would you feel if your own family were bombed to nothingness? Terrible, isn’t it?\n\nStriking innocent people will only ruin your reputation and derail what you claim is a war into a full-on genocide campaign. Stop before it's too late.\n\nSam",
      "image": "https://i.guim.co.uk/img/media/00b95ba248a4364bf2f3b447ad5d44aebadf7d5f/911_800_2537_1522/master/2537.jpg?width=465&dpr=1&s=none&crop=none",
      "peek": "An individual of Asian descent offers a structured critique of Benjamin Netanyahu's contentious policies, arguing they represent a significant deviation from established international norms and humanitarian principles. The analysis frames the disagreement within a geopolitical and ethical context."
    },
    {
      "name": "A Plea for Justice and Safety",
      "author": "Triet Le",
      "date": "21st November 2025",
      "letter": "We all have the power to shape a more equitable society...",
      "image": "https://media.cnn.com/api/v1/images/stellar/prod/200622104651-black-lives-matter-support-impact-0613.jpg?q=x_0%2Cy_100%2Ch_1125%2Cw_1999%2Cc_crop%2Fh_653%2Cw_1160%2Ff_avif",
      "peek": "A call to address ongoing racism and police violence against Black people. Despite being a small share of the population, they face disproportionate harm and fear. The writer urges White people to support change for the safety of Black communities and everyone."
    }
  ]
}