{
  "context": [
    {
      "title": "Racism in the Palestinian Conflict",
      "date": "3rd December 2025",
      "content": "The October ceasefire deal between Israel and Hamas (Palestine), Israel-Hamas Ceasefire Deal: October 2025 Agreement Explained | GovFacts, coordinated by the US Government, agrees that both sides will halt fighting in exchange for the return of hostages for both sides since the war started in late 2023. Despite the agreement, the Israeli government has many times accused Hamas of refusing to return hostages and taking such excuses to continue its airstrike campaign on Palestinian civilians. Israel launches strikes in Gaza, the ceasefire’s latest test, as hospitals say 24 are killed. Israeli strikes kill at least 32 people in Gaza despite the ceasefire. Many of these campaigns are to be blamed on the current Israeli Prime Minister, Benjamin Netanyahu, who is accused of committing several war crimes, according to the International Criminal Court. The Israeli-Palestinian conflict began way back in WW2, when the idea of forming a state for the Jewish people clashed with the homeland of the Palestinians.",
      "image": "https://www.hrw.org/sites/default/files/styles/16x9_large/public/multimedia_images_2018/201712mena_iopt_wrchapter.jpg?itok=QpFXd94F",
      "peek": ""
    },
    {
      "title": "Anti Anti-semitism",
      "date": "3rd December 2025",
      "content": "Anti-Semitism is racism directed at Jewish people, expressed through stereotypes, exclusion, and violence across more than two millennia of history. Hostility toward Jews appeared in the ancient Mediterranean world and hardened in Christian Europe from roughly the 4th century CE through the late Middle Ages via laws, expulsions, ghettoization, and recurring pogroms. In 1879, the term “antisemitism” was coined in Germany to give a pseudo-scientific, racial gloss to older hatreds, paving the way for early 20th‑century movements that culminated in Nazi power in 1933 and the Holocaust between 1941 and 1945. Today, anti-Semitism persists in conspiracy theories, Holocaust denial, and collective blame of Jews for the state of Israel, often spiking during wars such as the 2023–2025 Gaza conflict. An “anti-anti-semitism” stance grounded in hatred of racism recognizes this history and rejects all attempts to dehumanize or scapegoat Jews, while also opposing Islamophobia and anti-Palestinian racism.",
      "image": "https://commission.europa.eu/sites/default/files/2023-08/Antisemitism%20-%20handbook%20cover.jpg",
      "peek": ""
    },
    {
      "title": "Censorship of Governments",
      "date": "3rd December 2025",
      "content":"Government censorship of mass media suppresses information to control narratives, a practice spanning ancient empires to modern democracies. In the U.S., the 1798 Alien and Sedition Acts jailed critics of President John Adams; the 1917 Espionage Act targeted anti-war speech during World War I; and FDR's 1941 Office of Censorship reviewed all war news, opening 200 million letters by 1945. The 1971 Pentagon Papers case saw Nixon fail to block The New York Times under the First Amendment, while Bush (2003) embedded reporters with Iraq troops under restrictions, and Obama prosecuted leakers via Espionage Act prosecutions. In the second Trump administration (2025), the White House banned AP from Air Force One on February 14 due to naming disputes, shut down anti-disinformation offices, and ABC pulled Jimmy Kimmel Live (September 17-22, 2025) after comments on Charlie Kirk's assassination. Opposing this means defending press freedom against state overreach in all forms.",
      "image": "https://i.ibb.co/qLL4GTVF/image-8.png",
      "peek": ""
    },
    {
      "title": "Racism against black people",
      "date": "3rd December 2025",
      "content": "Racism against Black people in the U.S. dates back to 1619, when enslaved Africans arrived, evolving through slavery (ended 1865), Jim Crow laws (1896–1965), and redlining into modern police brutality and disparities. Black Lives Matter (BLM) formed in 2013 after George Zimmerman's acquittal for killing Trayvon Martin (Feb. 2012), surging in 2014 over Michael Brown (Ferguson, Aug. 9) and Eric Garner (Dec. 3). The 2020 peak came on May 25, when Minneapolis officer Derek Chauvin killed George Floyd, kneeling on his neck for 9+ minutes amid cries of 'I can't breathe,' sparking 15–26 million protesters in 2,500+ U.S. locations and globally—the most significant movement in U.S. history. Demands included defunding the police, ending cash bail, and reforming the justice system; most protests were peaceful, although riots caused $1–2 billion in damage by June 8. Support hit 67% in 2020 but fell to 51% by 2023. Opposing anti-Black racism means rejecting violence, demanding accountability, and building solidarity across races.",
      "image": "https://static01.nyt.com/images/2020/06/06/world/06unrest-global01sub/merlin_173255814_9331f2e7-bcb4-482c-b23f-616772e5b691-superJumbo.jpg",
      "peek": ""
    }
  ]
}