{
  "context": [
    {
      "title": "Racism in the Palestinian Conflict",
      "date": "3rd December 2025",
      "content": "The October ceasefire deal between Israel and Hamas (Palestine) coordinated by the US Government, agrees that both sides will halt fighting in exchange for the return of hostages for both sides since the war started in late 2023. Despite the agreement, the Israeli government has many times accused Hamas of refusing to return hostages and making such excuses to continue its airstrike campaign on Palestinian civilians. Many of these campaigns are to be blamed on the current Israeli Prime Minister, Benjamin Netanyahu, who is accused of committing several war crimes by the ICC. The Israeli-Palestinian conflict began way back in WW2, when the idea of forming a state for the Jewish people clashed with the homeland of the Palestinians.",
      "image": "https://www.hrw.org/sites/default/files/styles/16x9_large/public/multimedia_images_2018/201712mena_iopt_wrchapter.jpg?itok=QpFXd94F",
      "peek": "",
      "linknames": [
        "Israel-Hamas Ceasefire Deal Explained - GovFacts",
        "Israeli strikes in Gaza despite ceasefire - AP News",
        "Israeli strikes kill at least 32 in Gaza - The Washington Post",
        "Benjamin Netanyahu - ICC Profile"
      ],
      "links": [
        "https://govfacts.org/policy-security/israel-hamas-ceasefire-deal-october-2025-agreement-explained/",
        "https://apnews.com/article/gaza-israel-palestinians-hamas-war-news-535e21d36eea41fb9bba645ee7db014c",
        "https://www.washingtonpost.com/world/2025/11/19/israeli-strikes-gaza-ceasefire/",
        "https://www.icc-cpi.int/defendant/netanyahu"
      ]
    },
    {
      "title": "Anti Anti-semitism",
      "date": "3rd December 2025",
      "content": "Anti-Semitism is racism directed at Jewish people, expressed through stereotypes, exclusion, and violence across more than two millennia of history. Hostility toward Jews appeared in the ancient Mediterranean world and hardened in Christian Europe from roughly the 4th century CE through the late Middle Ages via laws, expulsions, ghettoization, and recurring pogroms. In 1879, the term ‘antisemitism’ was coined in Germany to give a pseudo-scientific, racial gloss to older hatreds, paving the way for early 20th-century movements that culminated in Nazi power in 1933 and the Holocaust between 1941 and 1945. Today, anti-Semitism persists in conspiracy theories, Holocaust denial, and collective blame of Jews for the state of Israel, often spiking during wars such as the 2023–2025 Gaza conflict. An ‘anti-anti-semitism’ stance rejects all attempts to dehumanize or scapegoat Jews, while opposing Islamophobia and anti-Palestinian racism.",
      "image": "https://commission.europa.eu/sites/default/files/2023-08/Antisemitism%20-%20handbook%20cover.jpg",
      "peek": "",
      "linknames": [
        "Antisemitism - Britannica",
        "Antisemitism - Wikipedia"
      ],
      "links": [
        "https://www.britannica.com/topic/antisemitism",
        "https://en.wikipedia.org/wiki/Antisemitism"
      ]
    },
    {
      "title": "Censorship of Governments",
      "date": "3rd December 2025",
      "content": "Government censorship of mass media suppresses information to control narratives, a practice spanning ancient empires to modern democracies. In the U.S., the 1798 Alien and Sedition Acts jailed critics of President John Adams; the 1917 Espionage Act targeted anti-war speech during World War I; and FDR's 1941 Office of Censorship reviewed all war news. In Trump’s 2025 administration, AP was banned from Air Force One, anti-disinformation offices were shut down, and ABC pulled Jimmy Kimmel Live. Opposing this means defending press freedom against state overreach.",
      "image": "https://i.ibb.co/qLL4GTVF/image-8.png",
      "peek": "",
      "linknames": [
        "Timeline of Internet Censorship - NCAC",
        "History of Censorship - Britannica"
      ],
      "links": [
        "https://ncac.org/resource/a-selective-timeline-of-the-internet-and-censorship",
        "https://www.britannica.com/topic/censorship/History-of-censorship"
      ]
    },
    {
      "title": "Racism against Black People",
      "date": "3rd December 2025",
      "content": "Racism against Black people in the U.S. dates back to 1619 and evolved through slavery, Jim Crow, and modern police brutality. Black Lives Matter formed in 2013 after the killing of Trayvon Martin. The 2020 peak followed the murder of George Floyd, sparking millions of protesters worldwide. Opposing anti-Black racism means demanding accountability and solidarity.",
      "image": "https://static01.nyt.com/images/2020/06/06/world/06unrest-global01sub/merlin_173255814_9331f2e7-bcb4-482c-b23f-616772e5b691-superJumbo.jpg",
      "peek": "",
      "linknames": [
        "Black Lives Matter - Britannica",
        "George Floyd Protests - Wikipedia"
      ],
      "links": [
        "https://www.britannica.com/topic/Black-Lives-Matter",
        "https://en.wikipedia.org/wiki/George_Floyd_protests"
      ]
    }
  ]
}