{
  "letters": [
    {
      "name": "Dear Anti-Semites, and Racists",
      "author": "Giang Vu",
      "date": "17th November 2025",
      "letter": "Dear Anti-Semites,\n\nI speak as a person who has heard, has learnt about, and has witnessed anti-Semitism. It is time that you stop hating on Jewish people just because of their culture and history. Every human being is born the same, and you still decide to hate on certain marginalised groups of people because of their nationalities and culture. Every society, every race, every country has people who are less fortunate and greedier than others, but there are also people who are kind and want good for humanity. So, let's be civilised and stop prejudicially hating on Jewish people.\n\nAnti-semitism has existed for nearly the entire recorded history of humanity. In the ages of the Greek and Roman empires, Jewish people's resistance and assimilation to their culture gained them much hate. Then, early Christians had blamed Jewish people for the death of Jesus, who, ethnically, is Jewish. In the Middle Ages and Renaissance, because of their religion and culture, Jewish people were segregated into ghettos and forced to not be able to do normal jobs, which led to them having to moneylend, a 'sinful' occupation according to Christianity. Then, in the 20th century, Nazi Germany had done the worst acts of them all. Adolf Hitler, Adolf Eichmann, and Heinrich Himmler, the orchestrators of the Holocaust, had concentrated and liquidated 6 million Jewish people. Just to put it in perspective, around 60 million people died in the Second World War. Jewish is arguably one of the most suffered races in history, so before judging one of them, consider what they had to endure.\n\nThe only Jewish person that I have encountered until now is a classmate. Every person has their own health, and in unfortunate cases, injuries. This classmate of mine happens to have their own psychological problems. Nobody wants to have injuries. They hurt, and they affect their lives in ways that are usually out of their own reach. Because of this, they sometimes can act in ways that are abnormal to the normal ways of humans. Despite this, some of my classmates decide to call and discriminate against them because they are Jewish. Their situation is hard to intervene in, so we should support them by helping in group works or just not causing harm that is within our capabilities. So why continue discriminating against them for their race? If they have their own problems, then the right way is to support them to work towards our benefits by addressing the problem, instead of blaming their races.\n\nEverything has its reasons. Newton's law of motion states that a force needs to be exerted in order to move something. Firstly, Jewish people were forced into moneylending in the Middle Ages. This caused Jewish people to have the stereotype of being greedy with money and wealth. A prime example of this stereotype is Shylock, a Jewish moneylender in The Merchant of Venice, who was portrayed as being greedy. Jewish people are known to be intelligent and smart. A lot of great minds in the development of humanity have Jewish heritage and practise it: Albert Einstein, Robert Oppenheimer, Niels Bohr, Mark Zuckerberg, Larry Page, and Sam Altman. But, because of their intelligence, Jewish people were blamed for being the masterminds behind crises, wars, and coups. Last but not least, in the following years, Israel has become notorious for their crimes against humanity in Gaza and the Middle East. Benjamin Netanyahu is Israel's prime minister and has been a terrible leader who created unnecessary hostility towards other countries and is responsible for the loss of thousands of lives and families. This had made Jewish people and Israel gain a hostile and bellicose reputation, deepening anti-Semitism around the world. The Israeli government had done a terrible job handling politics and unknowingly tarnished genuinely nice and good Jewish individuals.\n\nSo just because a person's identity is associated with negativity doesn't mean they want to be and are negative. Just because a person's identity has a past of being segregated doesn't mean you should segregate them. Just because a person's identity is associated with greed doesn't mean they are greedy. Just because a person's government is terrible doesn't mean they are terrible. Just because a person has mental problems doesn't mean you should mock their identity, or hell, even mock them in the first place. Just because a person is Jewish doesn't mean they are greedy, mischievous, cunning, or hostile. Hell, just because a person is associated with anything doesn't mean they are that. So not just you anti-Semites, but you prejudiced judges. Humans do not only have one side. We are the most complex species on this earth, and a person should be considered by all of their traits. So let's be civilised and understand each other before you even judge.\n\nGiang Vu.",
      "image": "https://i.ibb.co/rRJRPNRW/antisemitism.webp",
      "peek": "Before you judge an entire people, ask whether you’ve ever tried to understand them. Jewish communities have endured centuries of suffering, yet prejudice persists. If every person carries a story, why do we let hatred speak louder than humanity?"
    },
    {
      "name": "The True Face of Censorship",
      "author": "Tu Ho",
      "date": "17th November 2025",
      "letter": "Dear Government Officials,\n\nCensorship is often portrayed as a tool to maintain the structure of a country, the image of that country and social stability. According to BBC Earth and Britannica, instead of acting as their citizens’ protection, it restricted people from certain rights. There is a deeper and more unsettling truth, which is that censorship acts as a picture frame that shapes humans in the way it wants. It determines who gets the right to mic up, who is silenced, whose pain attracts attention and who is ignored. Nowadays, even though the government claims to protect pure morality, these leaders' true intention is prioritising their authority. In this way, it not only suppresses freedom, but it is also the forbidden of the truth in a materialistic world, the interpretation of history, and the resolve in the loss of humanity, leading to a brutal fact that truth can be selective. When truth is selective, justice starts to fade. If the truth is hidden behind the backstage, then how can justice be performed universally\n\nCensorship allows prejudice and privilege to be practised. It isn’t simply the silence of words, but it is the silence of the truth, of a community. This issue is critical not only of the forbidden truth but also of the interpretation of history. Basically, when governments and institutions decide what information can be debated, they prioritise their authority while muting others. The act of suppressing speech doesn’t help a system to control intolerance; it creates both fear and rage. Censorship ensures that only “suitable” or acceptable voices are heard; the others that seem to challenge or question their status are denied. In most of the system, privilege acts like a gatekeeper that separates humanity from the truth. Those with more privilege can easily access “platforms”, influence humanity, or even participate in important discussions with protection. While those without that privilege are shut down and oppressed. This inequality is deeply rooted in every political system, where people are living in a materialistic world, where honour, status and profit are more valuable than human beings. The truth is, who truly benefits from this silence? We all know it serves only those who are in charge of this system. They avoid criticism, refuse to confront the corruption of this system model and continue to rule despite the hardships. Yet, if we begin to raise awareness, we should ask ourselves a question: Should the system ever be determined by the directors only, or is it a universal ethic in which it is considered by the whole world?\n\nThe silence of the oppression that censorship brought to us is debatable. The tragedy of the actor Yu Mengkong, whose death was covered by silence due to the government censorship. After his death, to avoid the news spreading to the public, the Chinese government deleted all reports and online discussion, leaving the ashes of information of his death in the dead-end alley.  Those governments kept citizens from learning the truth, censored all news, and, above all, stifled his life by silencing his voice and denying him the freedom to live. This not only denied Yu Mekong the justice that he was supposed to receive but also eliminated the community's right to seek for the truth. For individuals, censorship isolates them from free speech. For marginalised groups, it reinforces the belief that their lives matter less in society. When the truth is hidden, victims are also forgotten, and while the cycle of censorship continues, Yu Mengkong’s story does not end here; it is a fate that will be repeated for many others, only to be met with further government silence. It is a system that values image over lives, obedience over the truth, and authority over human beings. Yu Mengkong’s story isn’t simply about social distance, but it is an alarm that awakens humans from a system that abuses the actual meaning of power and authority and anonymity as a system for protecting citizens but instead controlling them like a puppet. \n\nCensorship benefits most of those who have the power to rule a society. By controlling public opinion, they ensure that their authority will remain undefeated and drive the society as they will, like how propaganda was created and used for war and stereotypes. Ultimately, most governments rely on silence to preserve their order, an order built on fear rather than genuine respect. In this environment, privilege seems to be dominant because it is protected from criticism. Those who are not directly placed in the situation enjoy the luxury of being obeyed, while those who are silenced carry an invisible weight of the truth. Therefore, censorship is more like a weapon that is used not only to create a barrier that hides the truth behind the system but also to maintain the dominance of the powerful.\n\nIn conclusion, it indirectly supports prejudice, protects privilege and prevents seekers from pursuing the truth. If a government’s purpose is to serve its citizens with fairness, it must encourage free speech and open debate even when such discussions may challenge or criticise those in power. Transparency and authenticity are not threats to stability; instead, they are the very forces that strengthen it. After all, censorship doesn’t create peace; it is tolerated in the society, and it merely forces individuals into silence and buries the truth, like a gun pointed at the people, like a ghost that wanders around and haunts the city, like a thick fog that blinds the public and suffocates any spark of honesty before it can be lit up. \n\nWith hope to enhance the community.\n\nTu Ho.",
      "image": "https://i.ibb.co/HTRqMt99/unnamed.webp",
      "peek": "An unknown citizen criticize how the illusion of governmental censorship worsen the community, depicting it as a barrier that silences truth, and deepens human inequality. The critique is framed through moral, social, and political lenses in which it allow the issue to be scrutinize more thoroughly."
    },
    {
      "name": "To Netanyahu",
      "author": "Khoi Nguyen",
      "date": "18th November 2025",
      "letter": "Dear Benjamin Netanyahu,\n\nYou are an evil and masochistic person. The ceasefire deal has been signed, so it is time to stop the genocide in Palestine. Millions of innocent women and children are being torn apart by your commands, targeting hospitals and schools. It is time to stop. As the Prime Minister of the Jewish state of Israel, who gave you the right to kill innocent people en masse?\n\nSince the ceasefire deal, more than 100 Palestinians have died from military action by the Israeli military, mostly children, women, and elderly people. Despite the deal, your government has made no effort to enforce it and has broken the policy countless times; this isn’t just a war anymore, it is a genocide. Not to mention, most airstrike targets on your agenda are full of residential areas, schools, and hospitals—trust me, no military is crazy enough to station their troops there. If this isn’t racism, what is it?\n\nThis is truly terrible.\n\nSure, the Allies bombed German and Japanese residential areas all the time, but that was seven decades ago; things have changed. And do not try to legitimize your actions by comparing them to WWII; they carpet-bombed, while you target specific areas with precision technology. Families torn apart, lives ruined, opportunities taken away—it carries on even when ceasefire deals are signed. You are truly a terrible, racist, masochistic person. How would you feel if your own family were bombed to nothingness? Terrible, isn’t it?\n\nStriking innocent people will only ruin your reputation and derail what you claim is a war into a full-on genocide campaign. Stop before it's too late.\n\nKhoi Nguyen",
      "image": "https://i.guim.co.uk/img/media/00b95ba248a4364bf2f3b447ad5d44aebadf7d5f/911_800_2537_1522/master/2537.jpg?width=465&dpr=1&s=none&crop=none",
      "peek": "An individual of Asian descent offers a structured critique of Benjamin Netanyahu's contentious policies, arguing they represent a significant deviation from established international norms and humanitarian principles. The analysis frames the disagreement within a geopolitical and ethical context."
    },
    {
      "name": "A Plea for Justice and Safety",
      "author": "Triet Le",
      "date": "21st November 2025",
      "letter": "Dear White people,\n\nRacism has always been the most annoying issue in the world. Throughout many years, with many protests, it still remains. I am writing this letter to seek protests for not only other people's safety but also my safety.\n\nThis year in America, over 500 people were killed by police, and most of them were Black, even though Black people only make up 13% of the population. Today, you can easily see many images or videos about racism on the internet or just search keywords about racism. There will be a million racist videos, but most are about white police shooting Black people or Black people standing up for their own safety. Imagine you are driving your new car with your wife and your daughter; you get stopped by a white police officer, and they immediately throw you down the road for no reason just because the car you were driving was similar to a car that was stolen. Not even asking you for any paper or anything, but just throwing you down the road, sitting on you, and if you try to defend yourself or stand up to explain, they will tease you, or even worse, they might shoot you in front of your daughter or your wife. The police, who should protect your safety, now are the biggest threat to it.\n\nThis is just a terrifying reality that every Black person lives with every day, from the time they were born till now.\n\nIn society, when hearing that a police officer shot a Black person, most people might think it was the victim's fault because on the internet there are many images or videos about them as thugs and criminals. But is it really all of them? For me, I used to have a lot of Black friends. All of them are very cool and funny and also friendly with me. The thugs, the criminal ones, just take, like, 1 or 2% or even lower of the whole community in the USA.\n\nAfter all, I'm hoping that this letter may help the community to be safer for them and also for us.\n\nTriet Le",
      "image": "https://media.cnn.com/api/v1/images/stellar/prod/200622104651-black-lives-matter-support-impact-0613.jpg?q=x_0%2Cy_100%2Ch_1125%2Cw_1999%2Cc_crop%2Fh_653%2Cw_1160%2Ff_avif",
      "peek": "A call to address ongoing racism and police violence against Black people. Despite being a small share of the population, they face disproportionate harm and fear. The writer urges White people to support change for the safety of Black communities and everyone."
    }
  ]
}